app/controllers/citizens_controller.rb

DELETE FROM `citizens` WHERE `citizens`.`id` = 1
SELECT `citizens`.* FROM `citizens` WHERE `citizens`.`id` = 1 LIMIT 1
---
  def destroy
    Citizen.find(params[:id]).destroy