app/controllers/citizens_controller.rb

SELECT `citizens`.* FROM `citizens`
INSERT INTO `citizens` (`cmnd`, `name`, `birthday`, `sex`, `hometown`, `paddress`, `traddress`, `religion`, `edulevel`, `job`, `code`, `created_at`, `updated_at`) VALUES ('123253453656', 'datdo', '2001-01-21 00:00:00', 'Nam', 'Bac Ninh', 'Bac Ninh', 'Bac NInh', 'Phat giao', 'Dai hoc', 'IT', 22334455, '2021-12-17 04:27:24.946472', '2021-12-17 04:27:24.946472')
---
  def index
    @all = Citizen.all
    @citizen = Citizen.new
    @citizens = []
    @all.each do |citizen|
      if (checkcode(current_user.accountname, citizen.code) == true)
          @citizens.push(citizen)

SELECT `citizens`.* FROM `citizens` WHERE `citizens`.`id` = 8 LIMIT 1
---
  def show
    @citizen = Citizen.find(params[:id])

INSERT INTO `citizens` (`cmnd`, `name`, `birthday`, `sex`, `hometown`, `paddress`, `traddress`, `religion`, `edulevel`, `job`, `code`, `created_at`, `updated_at`) VALUES ('12345677777', 'Duong Nguyet Anh', '2001-02-11 00:00:00', 'Nu', 'Thi tran Ho - Thuan Thanh - Bac Ninh', 'Bac Ninh', 'Nam Tu Liem - Ha Noi', 'Phat giao', 'Dai hoc', 'Web dev', 12221526, '2021-12-26 16:40:05.783649', '2021-12-26 16:40:05.783649')
---
  def create
    @citizen = Citizen.new(citizen_params)

    respond_to do |format|
      if @citizen.save

SELECT COUNT(*) FROM `citizens`
SELECT `locals`.* FROM `locals`
SELECT `citizens`.* FROM `citizens`
---
  def overall
    @count = Citizen.count
    @locals = []
    @all = Local.all
    @all.each do |local|
      if (local.code >= 01 && local.code <= 63)
        @locals.push(local)
      end
    end

    @people = []

    @citizens = Citizen.all
    @male = 0
    @female = 0

    if (current_user.tk == "A1")
      @citizens.each do |citizen|
        if (citizen.sex == "Nam")
          @male += 1
        elsif (citizen.sex == "Nu")
          @female += 1
        end
      end
    else
      @citizens.each do |citizen|

DELETE FROM `citizens` WHERE `citizens`.`id` = 10
SELECT `citizens`.* FROM `citizens` WHERE `citizens`.`id` = 10 LIMIT 1
---
  def destroy
    Citizen.find(params[:id]).destroy

SELECT `citizens`.* FROM `citizens`
---
  def detail
    @citizens = Citizen.all

SELECT `citizens`.* FROM `citizens` WHERE `citizens`.`id` = 13 LIMIT 1
---
  def edit
    @citizen = Citizen.find(params[:id])

SELECT `citizens`.* FROM `citizens` WHERE `citizens`.`id` = 13 LIMIT 1
UPDATE `citizens` SET `citizens`.`name` = 'Van Quoc Cuong', `citizens`.`updated_at` = '2021-12-26 17:06:23.146799' WHERE `citizens`.`id` = 13
---
  def update
    @citizen = Citizen.find(params[:id])
    if @citizen.update(citizen_params)