app/controllers/locals_controller.rb

SELECT `locals`.* FROM `locals`
SELECT `citizens`.* FROM `citizens`
UPDATE `locals` SET `locals`.`updated_at` = '2021-12-26 16:45:37.382434', `locals`.`count` = 3 WHERE `locals`.`id` = 19
INSERT INTO `locals` (`name`, `code`, `status`, `created_at`, `updated_at`) VALUES ('Bac Ninh', 12, 'Chua hoan thanh', '2021-12-18 08:04:09.781563', '2021-12-18 08:04:09.781563')
INSERT INTO `locals` (`name`, `code`, `status`, `created_at`, `updated_at`) VALUES ('Bac Giang', 17, 'Chua hoan thanh', '2021-12-25 17:04:04.554573', '2021-12-25 17:04:04.554573')
INSERT INTO `locals` (`name`, `code`, `status`, `created_at`, `updated_at`) VALUES ('Que Vo', 1223, 'Chua hoan thanh', '2021-12-26 01:24:47.184334', '2021-12-26 01:24:47.184334')
---
  def index
    @locals = Local.all
    @results = []
    @citizens = Citizen.all

    @locals.each do |local|
      temp = 0;
      @citizens.each do |citizen|
        if (checkcode(local.code, citizen.code) == true)
          temp += 1
        end
      end
      local.update_attribute(:count, temp)
    end

    @locals.each do |local|
      if (current_user.tk == "A1")
        if (local.code >= 0 && local.code <= 63)
          @results.push(local)
        end
      elsif (current_user.tk == "A2")
        if (local.code >= 0101 && local.code <= 6399 && checkcode(current_user.accountname, local.code) == true )
          @results.push(local)
        end
      elsif (current_user.tk == "A3")
        if (local.code >= 010101 && local.code <= 639999 && checkcode(current_user.accountname, local.code) == true )
          @results.push(local)
        end
      elsif (current_user.tk == "B1")
        if (local.code >= 01010101 && local.code <= 63999999 && checkcode(current_user.accountname, local.code) == true )
          @results.push(local)

SELECT `locals`.* FROM `locals` WHERE `locals`.`id` = 7 LIMIT 1
---
  def show
    @local = Local.find(params[:id])

INSERT INTO `locals` (`name`, `code`, `status`, `created_at`, `updated_at`, `count`) VALUES ('Ha Noi', 29, 'Chua hoan thanh', '2021-12-26 16:45:57.883351', '2021-12-26 16:45:57.883351', 0)
---
  def create
    @local = Local.new(local_params)

    respond_to do |format|
      if @local.save

DELETE FROM `locals` WHERE `locals`.`id` = 22
SELECT `locals`.* FROM `locals` WHERE `locals`.`id` = 12 LIMIT 1
---
  def destroy
    Local.find(params[:id]).destroy

SELECT `locals`.* FROM `locals`
SELECT `locals`.* FROM `locals` WHERE `locals`.`code` = 36 LIMIT 1
UPDATE `locals` SET `locals`.`status` = 'Da hoan thanh', `locals`.`updated_at` = '2021-12-26 09:13:06.743655' WHERE `locals`.`id` = 19
---
  def sublocal
    @all = Local.all
    @current_local = Local.find_by(code: params[:code])
    @current_code = params[:code]
    @locals = []
    @all.each do |local|
      if (local.code != @current_code)
        if (checkcode(@current_code, local.code) == true)
          if (@current_code.to_i >= 01 && @current_code.to_i <= 63)
            if (local.code >= 0101 && local.code <= 6399)
              @locals.push(local)
            end
          elsif (@current_code.to_i >= 0101 && @current_code.to_i <= 6399)
            if (local.code >= 010101 && local.code <= 639999)
              @locals.push(local)
            end
          elsif (@current_code.to_i >= 010101 && @current_code.to_i <= 639999)
            if (local.code >= 01010101 && local.code <= 63999999)
              @locals.push(local)

SELECT `locals`.* FROM `locals` WHERE `locals`.`code` = 12221526 LIMIT 1
UPDATE `locals` SET `locals`.`status` = 'Da hoan thanh', `locals`.`updated_at` = '2021-12-26 17:07:23.884495' WHERE `locals`.`id` = 19
UPDATE `locals` SET `locals`.`status` = 'Chua hoan thanh', `locals`.`updated_at` = '2021-12-26 17:04:53.034440' WHERE `locals`.`id` = 19
SELECT `locals`.* FROM `locals`
UPDATE `locals` SET `locals`.`status` = 'Da hoan thanh', `locals`.`updated_at` = '2021-12-26 17:07:23.926209' WHERE `locals`.`id` = 17
UPDATE `locals` SET `locals`.`status` = 'Chua hoan thanh', `locals`.`updated_at` = '2021-12-26 17:04:53.097758' WHERE `locals`.`id` = 17
---
  def change_status
    @local = Local.find_by(code: params[:code])

    if (@local.status == "Chua hoan thanh")
      @local.update_attribute(:status, "Da hoan thanh")
    else
      @local.update_attribute(:status, "Chua hoan thanh")
    end

    @locals1 = Local.all
    @locals2 = Local.all

    @locals1.sort_by{|e| -e[:code]}

    @locals1.each do |local1|
      if (local1.code != @local.code && checkcode(local1.code,@local.code ) == true && local1.code < 01010101)
        signal = true
        @locals2.each do |local2|
          if (local2.code != local1.code && checkcode(local1.code,local2.code ) == true && local2.status == "Chua hoan thanh")
            signal = false
          end
        end

        if (signal == true)
          local1.update_attribute(:status, "Da hoan thanh")
        else
          local1.update_attribute(:status, "Chua hoan thanh")